{
  "data": [
    {
      "id": "2ad6b5e2-9c2b-4959-b740-9335c85eed74",
      "title": "Fail Safe",
      "author": "Eugene Burdick y Harvey Wheeler",
      "genres": ["drama", "belico", "politica"],
      "cover": "http://localhost:5173/failsafe.jpg",
      "intro": "Por un error militar, un cazabombardero nuclear americano recibe la orden de destruir Moscú. Los jefes militares y políticos de los dos países tratan de evitar la catástrofe.",
      "completed": true,
      "review": "Nos hallamos ante una novela-reportaje apasionante, cuya lectura no puede dejarse después de empezada ni olvidarse después. Los caracteres que describe son dignos de ser recordados y los detalles técnicos plenamente convincentes"
    },
    {
      "id": "9942219d-eecc-42b5-a421-2d9b12736b76",
      "title": "Código limpio",
      "author": "Robert C. Martin",
      "genres": ["informatica", "didactico"],
      "cover": "http://localhost:5173/codigolimpio.webp",
      "intro": "Cada año, se invierten innumerables horas y se pierden numerosos recursos debido a código mal escrito, ralentizando el desarrollo, disminuyendo la productividad, generando graves fallos e incluso pudiendo acabar con la organización o empresa.",
      "completed": false,
      "review": "El reconocido experto de software Robert C. Martin, junto con sus colegas de Object Mentor, nos presentan sus óptimas técnicas y metodologías ágiles para limpiar el código sobre la marcha y crearlo de forma correcta, de este modo mejorará como programador. Esta obra se divide en tres partes. La primera describe los principios, patrones y prácticas para crear código limpio. La segunda incluye varios casos de estudio cuya complejidad va aumentando. Cada ejemplo es un ejercicio de limpieza y transformación de código con problemas. La tercera parte del libro contiene una lista de heurística y síntomas de código erróneo (smells) confeccionada al crear los casos prácticos. El resultado es una base de conocimientos que describe cómo pensamos cuando creamos, leemos y limpiamos código. Imprescindible para cualquier desarrollador, ingeniero de software, director de proyectos, jefe de equipo o analista de sistemas interesado en crear código de mejor calidad. ¡El libro que todo programador debe leer!"
    },
    {
      "id": "486038f-gghh-51b6-y532-3v6x34591f97",
      "title": "El Señor de los Anillos el Retorno del Rey",
      "author": "J. R. R. Tolkien",
      "genres": ["fantasia", "ficcion"],
      "cover": "http://localhost:5173/elretornodelrey.jpg",
      "intro": "Los ejércitos del Señor Oscuro van extendiendo cada vez más su maléfica sombra por la Tierra Media. Hombres, elfos y enanos unen sus fuerzas para presentar batalla a Sauron y sus huestes. Ajenos a estos preparativos, Frodo y Sam siguen adentrándose en el país de Mordor en su heroico viaje para destruir el Anillo de Poder en las Grietas del Destino.",
      "completed": false,
      "review": "Me gusta que los capítulos se centren en cada división de la comunidad, en vez de dar saltos de una a otra. En cambio, considero que la división en libros resta más que suma: la parte del anillo se queda un poco coja, mientras que la parte más bélica es muy potente. Haber intercalado ambas historias, a mi juicio, habría enriquecido aún más el resultado final."
    },
    {
      "id": "385192s-ddee-62c7-k765-5v7g87532z67",
      "title": "The Godfather",
      "author": "Mario Puzo",
      "genres": ["policial", "drama"],
      "cover": "http://localhost:5173/godfather.jpg",
      "intro": "La publicación de El Padrino en 1969 supuso una convulsión en el mundo literario. Por primera vez, la Mafia protagonizaba una novela y era retratada desde dentro con acierto y verosimilitud. Mario Puzo la presentaba no como una mera asociación de facinerosos, sino como una compleja sociedad con una cultura propia y una jerarquía aceptada incluso más allá de los círculos de delincuencia. El Padrino narra la historia de un hombre: Vito Corleone, el capo más respetado de Nueva York. Déspota benevolente, implacable con sus rivales, inteligente, astuto y fiel a los principios del honor y la amistad, Don Corleone dirige un emporio que abarca el fraude y la extorsión, los juegos de azar y el control de los sindicatos. La vida y negocios de Don Corleone, así como los de su hijo y heredero Michael, conforman el eje de esta magistral obra. Con El Padrino, Mario Puzo partió de la realidad y consiguió crear un género. La Mafia pasó a ser tema central de centenares de novelas y películas, aunque ninguna de ellas ha alcanzado el nivel de la obra que las inspiró.",
      "completed": true,
      "review": "Mario Puzo crea una genial historia, creíble, seria, y realiza un género en sí mismo. Da páginas enteras a describir muchos personajes, no sólo Don Vito, el gran patriarca cuyo origen tiene su imperio en la importación de aceite de oliva; sus hijos: Santino, Freddie, Michael y Constanza, hasta su propia mujer. Tom Hagen, su Consigliori, hijo adoptado pero que mantiene su nombre y apellidos, Lucy Mancini, Kay Adams, Appolonia, el cantante y actor, apadrinado por Don Vito, Johnny Fontane, semejante a Frank Sinatra, algo de eso hay en las páginas del libro; los casinos de las Vegas a comienzos de la década de los 40/50, un emporio económico gigantesco y de proporciones épicas para la extorsión, diversión, y el juego, claro en su más amplio aspecto. Puzo desmenuza una sociedad, un tiempo, y de paso nos coloca a la Mafia desde adentro, donde los buenos/malos se confunden en sus páginas, todos tienen sus razones encomiables y serenas que debatir y llevar a cabo, en un texto que se lee muy bien, Extenso en su elaboración, Puzo desmenuza los entresijos cotidianos de una familia, y da un giro amplio para que los valores tradicionales no caigan en manos extrañas, cuando Michael Corleone después de su exilio siciliano y de un largo aprendizaje de los negocios paternos, empieza a hacerse cargo de los mismos, se sorprende del verdadero poder de la familia Corleone, y también de su hermosa riqueza."
    }
  ]
}
